{
  "Test": {
    "home": "english test"
  },
  "Manifest": {
    "name": "My App"
  },
  "LocaleLayout": {
    "title": "Portfolio"
  },
  "LocaleSwitcher": {
    "label": "Language",
    "locale":"{locale}"
  },
  "Header": {
    "name":"Achraf Reyani",
    "home":"Home",
    "about":"About",
    "resume":"Resume",
    "portfolio":"Portfolio",
    "contact":"Contact"
  },
  "Home": {
    "introduction":"I'm Achraf Reyani.",
    "bottom_text":"I'm a fullstack developer with a focus on React, currently based in Japan."
  },
  "About": {
    "title":"About me",
    "description":"My initial curiosity for software development inspired me to pursue a Bachelor's degree in Computer Science, where I discovered a strong passion for web development, particularly fullstack development. This passion has guided my journey as a curious and dedicated developer focused on building robust fullstack applications using modern frameworks like Next.js and backend services such as Supabase and Firebase. I’m also very interested in being involved in the whole cycle of software development—from writing code to testing, deployment, and maintenance."
  },
  "Resume": {
    "education":"Education",
    "university_title":"Bachelor's degree in Computer Science",
    "university_name":"Rotterdam University of Applied Sciences",
    "university_description":"During my studies at Rotterdam University of Applied Sciences, I built a strong foundation in computer science through both theoretical coursework and hands-on projects. I gained practical experience in fullstack web development using modern technologies and frameworks, and participated in collaborative group assignments that emphasized agile methodologies and version control with Git. Additionally, I had opportunities to engage in internships and real-world software development tasks, which strengthened my skills in software design, testing, and deployment. Throughout my education, I developed critical problem-solving abilities and learned to work effectively within diverse teams.",
    "work":"Work",
    "job_1_name":"Current Job",
    "job_1_description":"Description of current job.",
    "job_2_name":"Previous Job",
    "job_2_description":"Description of previous job.",
    "download_link":"Download Resume",
    "download_link_description":"For more details please check out my resume."
  },
  "Portfolio": {
    "title":"Check out my personal projects.",
    "project_1":"project 1",
    "project_2":"project 2",
    "project_3":"project 3"
  },
  "Contact": {
    "title":"Get in touch.",
    "name":"Name",
    "email":"Email",
    "subject":"Subject",
    "message":"Message",
    "submit":"Submit",
    "my_address":"Tsukuba, Japan",
    "success_message": "Thanks for reaching out! Your message has been sent successfully. I'll get back to you soon.",
    "error_message": "Oops! Something went wrong while sending your message. Please try again later or contact me directly via email.",
    "sending": "Sending your message..."
  }
}
